#include <iostream>
#include <cmath>
using namespace std;



/*左传声器指向性因数 A = 
右传声器指向性因数 B = 
传声器膜片半张角 a = x * pi / 180
两传声器间距 D = 
声速 c = 343
*/

/*
void boop(float arr[], int size) {
    for (int i = 0; i < size + 1; i++) {
        if (arr[i] < arr[i + 1]) {
            float save = arr[i];
            arr[i] = arr[i + 1];
            arr[i + 1] = save;
        }            
    }
}
*/

int main() {
    const float  pi = acos(-1);
    int c = 343;

    float A = 0;
    float B = 0;
    float a = 0;
    float D = 0;
    float b = 0;
    float L = 0;
    float T = 0;

    float arr_T[900];
    int arr_T_size = sizeof(arr_T) / sizeof(arr_T[0]);
    float arr_L[900];
    int arr_L_size = sizeof(arr_L) / sizeof(arr_L[0]);
    float arr_b[900];
    
    for (int i = 0; i < arr_T_size + 1; i++) arr_T[i] = 0;
    for (int i = 0; i < arr_L_size + 1; i++) arr_L[i] = 0;


    float qdc[] = {0, 0.11, 0.22, 0.33, 0.44, 0.55, 0.66, 0.78, 0.90, 1.01, 1.13, 1.25, 1.37, 1.49, 1.61, 1.73, 1.86, 1.98, 2.11, 2.23, 2.36, 2.49, 2.61, 2.74, 2.78, 3, 3.13, 3.26, 3.39, 3.53, 3.66, 3.79, 3.93, 4.06, 4.20, 4.33, 4.47, 4.61, 4.75, 4.89, 5.03, 5.17, 5.32, 5.46, 5.6, 5.75, 5.90, 6.05, 6.20, 6.35, 6.5, 6.65, 6.81, 6.97, 7.13, 7.29, 7.45, 7.51, 7.78, 7.95, 8.12, 8.29, 8.47, 8.64, 8.82, 9.01, 9.19, 9.38, 9.57, 9.77, 9.96, 10.16, 10.37, 10.57, 10.79, 11, 11.22, 11.44, 11.67, 11.9, 12.13, 12.37, 12.62, 12.87, 13.12, 13.38, 13.65, 13.92, 14.19, 14.47, 14.76, 15.06, 15.36, 15.66, 15.97, 16.29, 16.62, 16.95, 17.3, 17.64, 18};
    float sjc[] = {0, 0.008, 0.015, 0.023, 0.031, 0.04, 0.048, 0.057, 0.066, 0.075, 0.084, 0.094, 0.103, 0.112, 0.122, 0.132, 0.141, 0.151, 0.161, 0.171, 0.180, 0.190, 0.2, 0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.299, 0.309, 0.319, 0.329, 0.339, 0.349, 0.359, 0.369, 0.379, 0.389, 0.399, 0.409, 0.419, 0.429, 0.439, 0.449, 0.459, 0.47, 0.48, 0.491, 0.501, 0.512, 0.523, 0.534, 0.545, 0.556, 0.568, 0.580, 0.592, 0.604, 0.616, 0.629, 0.642, 0.655, 0.669, 0.683, 0.697, 0.712, 0.727, 0.743, 0.759, 0.775, 0.792, 0.81, 0.828, 0.847, 0.866, 0.886, 0.906, 0.928, 0.949, 0.972, 0.996, 1.02, 1.045, 1.071, 1.097, 1.125, 1.154, 1.183, 1.214, 1.246, 1.278, 1.312, 1.347, 1.384, 1.421, 1.46, 1.5};

    float arr_T_percent[900];
    float arr_L_percent[900];

    int select = 0;
    int select_1 = 0;
    int select_2 = 0;

    cout << "您使用的拾音制式为( )号？"<< "\n" << "1: INA" << "\n" <<"2: OCT" << "\n" << "3: Decca" << "\n" << "4: nearcoincident" << "\n" << "5: TSRS" << "\n" << "6.自定义" << endl;
    cin >> select;

    if(select == 1){
        cout << "您使用的是INA3 还是 INA5？" << "\n" << "1: INA3" << "\n" <<"2: INA5" << endl;
        cin >> select_1;
            if(select_1 == 1){
                cout << " 请您选择INA3的具体配置"<< "\n" << "1:"<< "膜片半张角:50度, LR传声器间距:1.26米"<< "\n" << "2:" << "膜片半张角:60度, LR传声器间距:0.92米" << "\n" << "3:" << "膜片半张角:70度, LR传声器间距:0.68米" << "\n" << "4:" << "膜片半张角:80度, LR传声器间距:0.49米" << "\n" << "5:" << "膜片半张角:90度, LR传声器间距:0.35米" <<endl;
                cin >> select_2;
                if(select_2 == 1){
                    A = 0.5;    //指向性因数
                    B = 0.5;    //指向性因数
                    D = 1.26;   //左右传声器间距（米）
                    a = 50;     //传声器膜片半张角
                    a = a * pi/180;
                }
                if(select_2 == 2){
                    A = 0.5;    //指向性因数
                    B = 0.5;    //指向性因数
                    D = 0.92;   //左右传声器间距（米）
                    a = 60;     //传声器膜片半张角
                    a = a * pi/180;
                }
                if(select_2 == 3){
                    A = 0.5;    //指向性因数
                    B = 0.5;    //指向性因数
                    D = 0.68;   //左右传声器间距（米）
                    a = 70;     //传声器膜片半张角
                    a = a * pi/180;
                }
                if(select_2 == 4){
                    A = 0.5;    //指向性因数
                    B = 0.5;    //指向性因数
                    D = 0.49;   //左右传声器间距（米）
                    a = 80;     //传声器膜片半张角
                    a = a * pi/180;
                } 
                if(select_2 == 5){
                    A = 0.5;    //指向性因数
                    B = 0.5;    //指向性因数
                    D = 0.35;   //左右传声器间距（米）
                    a = 90;     //传声器膜片半张角
                    a = a * pi/180;
                }  
            }
            if(select_1 == 2){
                A = 0.5;    //指向性因数
                B = 0.5;    //指向性因数
                D = 0.35;   //左右传声器间距（米）
                a = 90;     //传声器膜片半张角
                a = a * pi/180;
            }
    }
    
    if(select == 2){
        cout << "请您输入左右传声器间距（单位:米 范围:0.4米 ~ 1米）？" << endl;
        A = 0.366;
        B = 0.634;
        cin >> D;
        a = 90;
        a = a * pi/180;
    }

    if(select == 3){
        A = 1;
        B = 0;
        D = 2;
        a = 0;
        a = a * pi/180;
    }
    
    if(select == 4){
        A = 0.366;
        B = 0.634;
        D = 0.35;
        a = 30;
        a = a * pi/180;
    }

    if(select == 5){
        A = 0.5;
        B = 0.5;
        D = 0.88;
        a = 70;
        a = a * pi/180;
    }

    if(select == 6){
        cout << "请输入指向性因数A" << "\n" << endl;
        cin >> A;

        cout << "请输入指向性因数B" << "\n" << endl;
        cin >> B;

        cout << "请输入左右传声器间距（单位：米）" << "\n" << endl;
        cin >> D;

        cout << "请输入传声器膜片半张角（单位：度）" << "\n" << endl;
        cin >> a;
    }
    
    for(int i = 0; i < 901; i++) {
        b = i * 0.1;            
        L = 20 * log10((A + B * cos(a-b * pi / 180)) / (A + B * cos(a+b * pi / 180)));
        if(b == 0) T = 0;
        T = 1000 * sin(b * pi / 180) * D / c;
        arr_T[i] = T;
        arr_L[i] = L;
        arr_b[i] = b;

        for (int j = 0; j < 101; j++){
            if(arr_L[i] == qdc[j]) arr_L_percent[i] = j;
            if(arr_L[i] > 18) arr_L_percent[i] = 999;
            if(arr_L[i] > qdc[j] && arr_L[i] < qdc[j+1]) arr_L_percent[i] = j;

            if(arr_T[i] == sjc[j]) arr_T_percent[i] = j;
            if(arr_T[i] > 1.5) arr_T_percent[i] = 999;
            if(arr_T[i] > sjc[j] && arr_T[i] < sjc[j+1]) arr_T_percent[i] = j;
        }


        
        if(arr_T_percent[i] + arr_L_percent[i] == 100) 
        {
            cout << "声源入射角临界值为: "<< arr_b[i] << " 度" << endl;
            //cout << "声源入射角临界值为: "<< arr_L_percent[i] << " 度" << endl;
            //cout << "声源入射角临界值为: "<< arr_T_percent[i] << " 度" << endl;
            break;
        }

        
        if(arr_T_percent[i] == 999 || arr_L_percent[i] == 999) 
        {
            cout << "声源入射角临界值为: "<< arr_b[i] << " 度" << endl;
            //cout << "声源入射角临界值为: "<< arr_L_percent[i] << " 度" << endl;
            //cout << "声源入射角临界值为: "<< arr_T_percent[i] << " 度" << endl;
            break;
        }

    }

}


